I'm working on this issue in my branch
https://github.com/tabito-hara/terraform-provider-aws/commits/f-aws_api_gateway_usage_plan_key-make_value_sensitive/

I confirmed that 'value' is not displayed as "sensitive" when my modified branch is used.

```console
  # aws_api_gateway_usage_plan_key.test[0] must be replaced
-/+ resource "aws_api_gateway_usage_plan_key" "test" {
      ~ id            = "rek7r0asm9" -> (known after apply)
      ~ name          = "tabito-test-0" -> (known after apply)
      ~ usage_plan_id = "3hb1p1" -> (known after apply) # forces replacement
      ~ value         = (sensitive value)
        # (2 unchanged attributes hidden)
    }
```

I will raise PR on this issue soon.